{
  "cantinas": [
    {
      "name": "Sports",
      "restaurants": [
        {
          "name": "noodles and dumplings",
          "description":
            "Serving a large selection of noodle, dumpling and wonton dishes, this is the place to get your asian on"
        },
        {
          "name": "japanese curry",
          "description":
            "Various rice bowls, with and without curry. Known as the \"Blue place\""
        },
        {
          "name": "steak house",
          "description":
            "Noodle or rice dishes that include steak and porkchop toppings. Served on hot plates. Known as the \"Green place\" "
        },
        {
          "name": "amani fusion kitchen",
          "description":
            "Dishes from all around Asia, especially famous for its Chicken Nanban and Singaporean chicken curry. Known as the \"Orange place\""
        },
        {
          "name": "mediterranean",
          "description":
            "Food from all over the Mediterranean, usually involves beef, pork or fish. Many of the dishes are gratined, making this one of the few places at campus you can get cheesy food. Served with rice or macaroni. Menu changes weekly"
        },
        { "name": "pork rib rice", "description": "F" },
        { "name": "korean food", "description": "G" },
        {
          "name": "breakfast",
          "description":
            "A popular place for a nice snack, each price includes a refreshing glass of milk tea"
        },
        { "name": "taiwan food", "description": "I" },
        {
          "name": "buffet",
          "description":
            "Provides a varied selection of meat, vegetables, fish and more. Perfect place if you're in the mood for everything. Price is based on weight"
        }
      ]
    },
    {
      "name": "EE",
      "restaurants": [
        { "name": "chinese pastries and snacks", "description": "K" },
        {
          "name": "tian sia life mall",
          "description":
            "Noodles of all kinds, but what separates this shop from the others is the black pepper and bolognese versions."
        },
        { "name": "bakery", "description": "M" },
        { "name": "vegetarian buffet", "description": "N" },
        {
          "name": "steamed and fried dumplings",
          "description":
            "EE cantina's #1 spot for dumplings, here you can also find cheap noodle dishes, wontons and comforting bowls of soup. Try "
        },
        { "name": "general buffet", "description": "P" },
        {
          "name": "shallot pie",
          "description":
            "Shallot pancakes with soy sauce, spicy sauce and pepper. A great snack for when you just need something for the road. Every dish comes with egg and a drink"
        },
        { "name": "japanese food", "description": "R" },
        {
          "name": "hot snacks",
          "description":
            "Burgers, toasts, subs, and burritos. Also provides sets with milk tea and side dishes at a discount"
        }
      ]
    },
    {
      "name": "Faculty",
      "restaurants": [
        { "name": "general buffet", "description": "U" },
        { "name": "fast-food and noodles", "description": "V" },
        { "name": "tea-bar", "description": "W" }
      ]
    }
  ]
}
